core/app/controllers/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'clute.25s@osu.edu' LIMIT 1
UPDATE "users" SET "updated_at" = '2026-01-08 21:35:37.246373', "otp_code" = '760172', "otp_sent_at" = '2026-01-08 21:35:37.246258' WHERE "users"."id" = 1
---
  def send_code
    email = params[:email].downcase.strip

    unless email.match?(/\A[\w+\-.]+@(osc\.edu|osu\.edu)\z/i)
      flash[:alert] = "Access restricted to @osc.edu or @osu.edu emails."
      return redirect_to new_user_session_path
    end

    @user = User.find_or_initialize_by(email: email)

    if @user.new_record?
      @user.password = Devise.friendly_token
      @user.save!

SELECT "users".* FROM "users" WHERE "users"."email" = 'clute.25s@osu.edu' LIMIT 1
---
  def verify_code
    email = session[:auth_email]
    code = params[:otp_code]
    user = User.find_by(email: email)